Revit 2027 API
ElectricalLoadClassification.Create Method
 Creates a new instance of load classification and adds it to the document.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElectricalLoadClassification Create(
	Document ADoc,
	string strName
)
Public Shared Function Create (
	ADoc As Document,
	strName As String
) As ElectricalLoadClassification
public:
static ElectricalLoadClassification^ Create(
	Document^ ADoc,
	String^ strName
)
static member Create :
        ADoc : Document *
        strName : string -> ElectricalLoadClassification
Parameters
ADoc Document
 The document where the element will be created and added.
strName String
 The name of the electrical load classification to be created.
Return Value
ElectricalLoadClassification
 The newly created load classification element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace